Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment Class
 The SurfaceTreatment class defines a layer above a building element defining what a surface looks like. The surface could for example have a tiled look.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.SurfaceTreatment
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SurfaceTreatment : ModelObject
<SerializableAttribute>
Public NotInheritable Class SurfaceTreatment
	Inherits ModelObject
The SurfaceTreatment type exposes the following members.
Constructors
Name | Description
SurfaceTreatment
 Creates a new surface treatment instance.
Top
Properties
Name | Description
Class
 The class of the surface treatment.
Color
 The color of the surfacing.
CutByFatherBooleans
 Defines if the part is cut by the father's cuts.
EndPoint
 Determines the direction the surfacing is filled in. The direction is from the start point towards the end point.
Father
 Defines the father part for the surface treatment: the part that the surface treatment is created on.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Material
 Defines the material for the surface treatment.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the surface treatment.
Polygon
 Defines the area for the surface treatment.
Position
 Defines the position for the surface treatment.
StartPoint
 Determines the origin of the surfacing. The surfacing is then filled out from the start point towards the end point.
Thickness
 Defines how thick the surface treatment is.
Type
 The type of the surfacing.
TypeName
 The name of the surface treatment type. The valid names are defined in the product_finishes.dat file.
Top
Methods
Name | Description
CompareTo
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
Delete
 Deletes the surface treatment with the given identifier from the database.
 (Overrides ModelObject.Delete().)
Equals
 Check if Identifiers of model objects are same.
 (Inherited from ModelObject.)
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetChildren
 Returns an enumerator of all the children model objects.
 (Inherited from ModelObject.)
GetCoordinateSystem
 Returns the coordinate system for the given model object.
 (Inherited from ModelObject.)
GetCustomObjectType
 Gets custom object type name from an existing object.
 (Inherited from ModelObject.)
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetDoubleUserProperties
 Retrieves all double properties for the model object.
 (Inherited from ModelObject.)
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
 (Inherited from ModelObject.)
GetFatherComponent
 Returns the father component of the model object.
 (Inherited from ModelObject.)
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
 (Inherited from ModelObject.)
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
 (Inherited from ModelObject.)
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 (Inherited from ModelObject.)
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
 (Inherited from ModelObject.)
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetStringUserProperties
 Retrieves all string properties for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, String)
 Retrieves a string property for the model object.
 (Inherited from ModelObject.)
Insert
 Inserts the surface treatment to the database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the surface treatment with the given identifier in the database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the surface treatment with the given identifier.
 (Overrides ModelObject.Select().)
SetCustomObjectType
 Sets a custom object type name for an existing object.
 (Inherited from ModelObject.)
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
 (Inherited from ModelObject.)
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 (Inherited from ModelObject.)
SetPhase
 Sets the phase of the model object.
 (Inherited from ModelObject.)
SetUserProperties
 Sets multiple properties for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Double)
 Sets a double property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, String)
 Sets a string property for the model object.
 (Inherited from ModelObject.)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ContourPlate cp = new ContourPlate();
           cp.Profile.ProfileString = "PL10";
           cp.Class = "3";
           cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point(10500, 15000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000,0),null));
           Contour c = new Contour();
           c.AddContourPoint(new ContourPoint(new Point( 6000,  6000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 9000,  6000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 9000, 12000,5), null));
           c.AddContourPoint(new ContourPoint(new Point(10500, 15000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 7500, 12000,5), null));
           cp.Insert();
           SurfaceTreatment treatment = new SurfaceTreatment();
           treatment.Father = cp;
           treatment.Polygon = c;
           treatment.StartPoint = new Point(1500,0000,0);
           treatment.EndPoint = new Point(1500,6000,0);
           bool Result = false;
           Result = treatment.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace